

#include <iostream>
#include <vector>


using namespace std;


int main()
{
    setlocale(0, "");
    vector<double> rubH = { 0, 0, 0, 0 };
    vector< vector<double> > hour = { {0,0,0,0,0,0,0,0,0,0,0,0}, {0,0,0,0,0,0,0,0,0,0,0,0}, {0,0,0,0,0,0,0,0,0,0,0,0},{0,0,0,0,0,0,0,0,0,0,0,0} };
    vector< vector<double> > mInf = {{ 0,0,0,0,0,0,0,0,0,0,0,0 }, { 0,0,0,0,0,0,0,0,0,0,0,0 }, { 0,0,0,0,0,0,0,0,0,0,0,0 }, { 0,0,0,0,0,0,0,0,0,0,0,0 }, { 0,0,0,0,0,0,0,0,0,0,0,0 }, { 0,0,0,0,0,0,0,0,0,0,0,0 }, { 0,0,0,0,0,0,0,0,0,0,0,0 }, { 0,0,0,0,0,0,0,0,0,0,0,0 }}
    ;
    vector<vector<double>> mSum = { {0, 0, 0, 0}, {0, 0, 0, 0} };

    int Numer;
    double mN = 0;

    for (int i = 0; i < 4; i++)
    {
        cout << "Введите почасовую ставку оплаты рабочего " << i + 1 << endl;
        cin >> rubH[i];
        for (int j = 0; j < 12; j++)
        {
            cout << "Введите сколько часов он отработал в месяце под номером " << j + 1 << endl;
            cin >> hour[i][j];

            mInf[i][j] = 0.87 * rubH[i] * hour[i][j];
            mInf[i+4][j] = rubH[i] * hour[i][j] - mInf[i][j];

            mSum[0][i] += mInf[i][j];
            mSum[1][i] += mInf[i + 4][j];

            
        }
        if (mN < mInf[i][2])
        {
            mN = mInf[i][2];
            cout << mN << " " << mInf[i][2] << endl;
            Numer = i + 1;
        }
            
    }
    
    cout << "Во втором месяце первый сотрудник получил: " << mInf[0][1] << endl; //Первый (1-1), Второй месяц (2-1)
    cout << "Сумма налога третьего работника: " << mSum[1][2] << endl;
    cout << "Номер работника, который заработал больше всех в третьем месяце: " << Numer << endl;
    cout << "Общая сумма заработанная бригадой: " << mSum[0][0] + mSum[0][1] + mSum[0][2] + mSum[0][3];
}

